
SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for xdict
-- ----------------------------
DROP TABLE IF EXISTS `xdict`;
CREATE TABLE `xdict` (
  `id` decimal(17,3) NOT NULL DEFAULT '0.000' COMMENT '编码',
  `idp` decimal(17,3) NOT NULL DEFAULT '0.000' COMMENT '上级编码',
  `_lock` tinyint(4) NOT NULL DEFAULT '0',
  `cat` char(16) NOT NULL DEFAULT '' COMMENT '数据归属，保留',
  `code` char(20) NOT NULL DEFAULT '' COMMENT '代码，简称',
  `text` char(40) NOT NULL DEFAULT '' COMMENT '名称',
  `typ` char(16) NOT NULL DEFAULT '' COMMENT '分类（-1：系统保留，不可编辑；0：用户所有，可编辑）',
  `stat` char(16) NOT NULL DEFAULT '' COMMENT '状态（1：启用；other：停用）',
  `dtnew` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '最新修改时间',
  `dtcreate` datetime DEFAULT NULL COMMENT '创建时间',
  `opcreate` int(11) NOT NULL DEFAULT '0' COMMENT '创建人',
  `ord` int(11) NOT NULL DEFAULT '0' COMMENT '排序号',
  `children` int(11) NOT NULL DEFAULT '0' COMMENT '子项计数',
  `expanded` tinyint(4) NOT NULL DEFAULT '0' COMMENT '是否展开（0：否；1：是）',
  `dtyp` char(16) NOT NULL DEFAULT '' COMMENT '值的类型（s：字符串；i：整数；f：浮点数；b：布尔值；d/dt：时间；a：自增长）',
  `dval` char(80) NOT NULL DEFAULT '' COMMENT '值',
  `dinfo` char(40) NOT NULL DEFAULT '' COMMENT '备注',
  PRIMARY KEY (`id`),
  UNIQUE KEY `xdict1` (`code`) USING BTREE,
  UNIQUE KEY `xdict2` (`idp`,`dval`) USING BTREE,
  KEY `xdict3` (`dtnew`) USING BTREE,
  KEY `xdict4` (`idp`,`ord`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;

-- ----------------------------
-- Records of xdict
-- ----------------------------
INSERT INTO `xdict` VALUES ('101.000', '1.000', '0', '', 'xroot', '系统字典', '-1', '1', '2015-09-27 08:08:05', null, '-1', '0', '11', '1', 'cat', '', '');
INSERT INTO `xdict` VALUES ('102.000', '1.000', '0', '', 'droot', '用户字典', '-1', '1', '2015-09-29 09:09:41', null, '-1', '2', '8', '1', 'cat', '102', '');
INSERT INTO `xdict` VALUES ('101001.000', '101.000', '0', '', 'sys', '系统公用类', 'String', '1', '2015-09-27 08:08:16', '2012-05-04 04:33:25', '-1', '0', '23', '1', '', 'sys', '');
INSERT INTO `xdict` VALUES ('101001001.000', '101001.000', '0', '', '_lock', '锁定类型', '系统项目', '启用', '2015-09-27 08:08:16', '2012-05-04 05:15:41', '-1', '0', '2', '1', 'cat', '_lock', '');
INSERT INTO `xdict` VALUES ('101001003.000', '101001.000', '0', '', 'booltyp', '是//否', 'String', '1', '2015-09-27 08:08:16', '2012-05-04 17:27:24', '-1', '0', '2', '1', '', 'boolean', '');
INSERT INTO `xdict` VALUES ('101001011.000', '101001.000', '0', '', 'xdicttyp', '字典分类', 'String', '1', '2015-09-27 08:08:16', '2012-05-04 05:17:33', '-1', '0', '2', '1', 'cat', 'xdicttyp', '');
INSERT INTO `xdict` VALUES ('101001012.000', '101001.000', '0', '', 'xdictstat', '字典项状态', 'String', '1', '2015-09-27 08:08:16', '2012-05-04 05:09:12', '-1', '0', '2', '1', '', 'xdictstat', '');
INSERT INTO `xdict` VALUES ('101001013.000', '101001.000', '0', '', 'xdictdtyp', '字典值类型', '-1', '1', '2015-09-27 08:08:16', '2012-05-04 05:09:33', '-1', '0', '5', '1', 'cat', 'xdictdtyp', '');
INSERT INTO `xdict` VALUES ('101001014.000', '101001.000', '0', '', 'xdictexpand', '展开状态', 'String', '1', '2015-09-27 08:08:16', '2012-05-04 05:12:03', '-1', '0', '2', '1', '', 'xdictexpand', '');
INSERT INTO `xdict` VALUES ('101001015.000', '101001.000', '0', '', 'xdepttyp', '组织类型', 'String', '1', '2015-09-27 08:08:16', '2012-05-04 16:21:20', '-1', '0', '2', '1', '', 'xdepttyp', '');
INSERT INTO `xdict` VALUES ('101001016.000', '101001.000', '0', '', 'xopertyp', '人员类型', 'String', '1', '2015-09-27 08:08:16', '2012-05-04 16:22:35', '-1', '0', '4', '1', '', 'xopertyp', '');
INSERT INTO `xdict` VALUES ('101001017.000', '101001.000', '0', '', 'xrighttyp', '权限类型', 'String', '1', '2015-09-27 08:08:16', '2012-05-04 16:23:03', '-1', '0', '2', '1', '', 'xrighttyp', '');
INSERT INTO `xdict` VALUES ('101001018.000', '101001.000', '0', '', 'xopersex', '性别', 'String', '1', '2015-09-27 08:08:16', '2012-05-06 04:27:21', '-1', '0', '2', '1', '', 'xopersex', '');
INSERT INTO `xdict` VALUES ('101001019.000', '101001.000', '0', '', 'xoperdstat', '工作状态', 'String', '1', '2015-09-27 08:08:16', '2012-05-06 08:23:57', '-1', '0', '4', '1', '', 'xoperdstat', '');
INSERT INTO `xdict` VALUES ('101001020.000', '101001.000', '0', '', 'recordstat', '公用记录状态', 'String', '1', '2015-09-27 08:08:16', '2012-05-09 00:06:59', '-1', '0', '5', '1', '', 'recordstat', '');
INSERT INTO `xdict` VALUES ('101001026.000', '101001.000', '0', '', 'currency', '币种', 'String', '1', '2015-09-27 08:08:16', '2012-05-14 07:53:13', '-1', '0', '3', '1', '', 'currency', '');
INSERT INTO `xdict` VALUES ('101001001001.000', '101001001.000', '0', '', '_lock0', '正常', '系统项目', '启用', '2015-09-27 08:08:16', '2012-05-04 05:23:00', '-1', '0', '0', '1', 'int', '0', '');
INSERT INTO `xdict` VALUES ('101001001002.000', '101001001.000', '0', '', '_lock1', '锁定', '系统项目', '启用', '2015-09-27 08:08:16', '2012-05-04 05:23:41', '-1', '0', '0', '1', 'int', '1', '');
INSERT INTO `xdict` VALUES ('101001003001.000', '101001003.000', '0', '', 'boolfalse', '否', 'String', '1', '2015-09-27 08:08:16', '2012-05-04 17:27:34', '-1', '0', '0', '1', '', '0', '');
INSERT INTO `xdict` VALUES ('101001003002.000', '101001003.000', '0', '', 'booltrue', '是', 'String', '1', '2015-09-27 08:08:16', '2012-05-04 17:29:07', '-1', '0', '0', '1', '', '1', '');
INSERT INTO `xdict` VALUES ('101001011001.000', '101001011.000', '0', '', 'xdicttyp0', '用户条目', '-1', '1', '2015-09-27 08:08:16', '2012-05-04 05:19:01', '-1', '0', '0', '1', 'int', '0', '用户条目，可编辑');
INSERT INTO `xdict` VALUES ('101001011002.000', '101001011.000', '0', '', 'xdicttyp1', '系统条目', '-1', '1', '2015-09-27 08:08:16', '2012-05-04 05:21:51', '-1', '0', '0', '1', 'int', '-1', '系统条目，不能编辑');
INSERT INTO `xdict` VALUES ('101001012001.000', '101001012.000', '0', '', 'xdictstat0', '停用', 'String', '1', '2015-09-27 08:08:16', '2012-05-04 05:25:44', '-1', '0', '0', '1', '', '0', '');
INSERT INTO `xdict` VALUES ('101001012002.000', '101001012.000', '0', '', 'xdictstat1', '启用', 'String', '1', '2015-09-27 08:08:16', '2012-05-04 12:18:32', '-1', '0', '0', '1', '', '1', '');
INSERT INTO `xdict` VALUES ('101001013001.000', '101001013.000', '0', '', 'xdictdtypcat', '分类(cat)', '-1', '1', '2015-09-27 08:08:16', '2015-02-18 15:47:23', '-1', '0', '0', '0', 'str', 'cat', '');
INSERT INTO `xdict` VALUES ('101001013002.000', '101001013.000', '0', '', 'xdictdtypstr', '字符(str)', '-1', '1', '2015-09-27 08:08:16', '2012-05-04 12:16:39', '-1', '0', '0', '0', 'str', 'str', '');
INSERT INTO `xdict` VALUES ('101001013003.000', '101001013.000', '0', '', 'xdictdtypint', '整数(int)', '-1', '1', '2015-09-27 08:08:16', '2012-05-04 12:17:04', '-1', '0', '0', '0', 'str', 'int', '');
INSERT INTO `xdict` VALUES ('101001013004.000', '101001013.000', '0', '', 'xdictdtypbool', '是否(bool)', '-1', '1', '2015-09-27 08:08:16', '2012-05-04 15:09:38', '-1', '0', '0', '0', 'str', 'bool', '');
INSERT INTO `xdict` VALUES ('101001013005.000', '101001013.000', '0', '', 'xdictdtypdouble', '浮点(double)', '-1', '1', '2015-09-27 08:08:16', '2012-05-04 15:10:35', '-1', '0', '0', '1', 'str', 'double', '');
INSERT INTO `xdict` VALUES ('101001014001.000', '101001014.000', '0', '', 'xdictexpand0', '收缩', 'String', '1', '2015-09-27 08:08:16', '2012-05-04 12:18:03', '-1', '0', '0', '0', '', '0', '');
INSERT INTO `xdict` VALUES ('101001014002.000', '101001014.000', '0', '', 'xdictexpand1', '展开', 'String', '1', '2015-09-27 08:08:16', '2012-05-04 12:18:17', '-1', '0', '0', '0', '', '1', '');
INSERT INTO `xdict` VALUES ('101001015001.000', '101001015.000', '0', '', 'xdepttyp0', '员工', 'String', '1', '2015-09-27 08:08:16', '2012-05-04 16:25:20', '-1', '0', '0', '1', '', '0', '');
INSERT INTO `xdict` VALUES ('101001015002.000', '101001015.000', '0', '', 'xdepttyp1', '客户', 'String', '1', '2015-09-27 08:08:16', '2012-05-04 16:29:29', '-1', '0', '0', '1', '', '1', '');
INSERT INTO `xdict` VALUES ('101001016001.000', '101001016.000', '0', '', 'xoperoper', '操作员', 'String', '1', '2015-09-27 08:08:16', '2012-05-05 17:57:25', '-1', '0', '0', '1', '', '0', '');
INSERT INTO `xdict` VALUES ('101001016002.000', '101001016.000', '0', '', 'xopercustomer', '客户', 'String', '1', '2015-09-27 08:08:16', '2012-05-06 04:19:25', '-1', '0', '0', '1', '', '2', '');
INSERT INTO `xdict` VALUES ('101001016003.000', '101001016.000', '0', '', 'xoperman', '管理员', 'String', '1', '2015-09-27 08:08:16', '2012-05-06 04:21:10', '-1', '0', '0', '1', '', '1', '');
INSERT INTO `xdict` VALUES ('101001016004.000', '101001016.000', '0', '', 'xoperagent', '代理商', 'String', '1', '2015-09-27 08:08:23', '2012-07-22 10:46:03', '-1', '0', '0', '1', '', '3', '');
INSERT INTO `xdict` VALUES ('101001017001.000', '101001017.000', '0', '', 'xrightmenu', '菜单', 'String', '1', '2015-09-27 08:08:16', '2012-05-06 04:24:16', '-1', '0', '0', '1', '', '1', '');
INSERT INTO `xdict` VALUES ('101001017002.000', '101001017.000', '0', '', 'xrightright', '操作权限', 'String', '1', '2015-09-27 08:08:16', '2012-05-06 04:25:59', '-1', '0', '0', '1', '', '0', '');
INSERT INTO `xdict` VALUES ('101001018001.000', '101001018.000', '0', '', 'xopermale', '男', 'String', '1', '2015-09-27 08:08:16', '2012-05-06 04:28:56', '-1', '0', '0', '1', '', '0', '');
INSERT INTO `xdict` VALUES ('101001018002.000', '101001018.000', '0', '', 'xoperfemale', '女', 'String', '1', '2015-09-27 08:08:16', '2012-05-06 04:33:11', '-1', '0', '0', '1', '', '1', '');
INSERT INTO `xdict` VALUES ('101001019001.000', '101001019.000', '0', '', 'xoperdstat0', '在职', 'String', '1', '2015-09-27 08:08:16', '2012-05-06 08:26:08', '-1', '0', '0', '1', '', '0', '');
INSERT INTO `xdict` VALUES ('101001019002.000', '101001019.000', '0', '', 'xoperdstat1', '待岗', 'String', '1', '2015-09-27 08:08:16', '2012-05-06 08:26:35', '-1', '0', '0', '1', '', '1', '');
INSERT INTO `xdict` VALUES ('101001019003.000', '101001019.000', '0', '', 'xoperdstat2', '试用', 'String', '1', '2015-09-27 08:08:16', '2012-05-06 08:27:07', '-1', '0', '0', '1', '', '2', '');
INSERT INTO `xdict` VALUES ('101001019004.000', '101001019.000', '0', '', 'xoperdstat3', '离职', 'String', '1', '2015-09-27 08:08:16', '2012-05-06 08:27:23', '-1', '0', '0', '1', '', '3', '');
INSERT INTO `xdict` VALUES ('101001020001.000', '101001020.000', '0', '', 'recordstat0', '新建', 'String', '1', '2015-09-27 08:08:16', '2012-05-09 00:08:08', '-1', '0', '0', '1', '', '0', '');
INSERT INTO `xdict` VALUES ('101001020002.000', '101001020.000', '0', '', 'recordstat3', '待审', 'String', '1', '2015-09-27 08:08:16', '2012-05-09 00:08:35', '-1', '3', '0', '1', '', '3', '');
INSERT INTO `xdict` VALUES ('101001020003.000', '101001020.000', '0', '', 'recordstat5', '待批', 'String', '1', '2015-09-27 08:08:16', '2012-05-09 00:08:49', '-1', '5', '0', '1', '', '5', '');
INSERT INTO `xdict` VALUES ('101001020004.000', '101001020.000', '0', '', 'recordstat99', '发布', 'String', '1', '2015-09-27 08:08:16', '2012-05-09 00:09:16', '-1', '99', '0', '1', '', '99', '');
INSERT INTO `xdict` VALUES ('101001020005.000', '101001020.000', '0', '', 'recordstat1', '待提交', 'String', '1', '2015-09-27 08:08:23', '2012-07-08 18:28:36', '-1', '1', '0', '0', '', '1', '');
INSERT INTO `xdict` VALUES ('101001026001.000', '101001026.000', '0', '', 'currency0', '人民币', 'String', '1', '2015-09-27 08:08:16', '2012-05-14 07:53:32', '-1', '0', '0', '1', '', '0', '');
INSERT INTO `xdict` VALUES ('101001026002.000', '101001026.000', '0', '', 'currency1', '美元', 'String', '1', '2015-09-27 08:08:16', '2012-05-14 07:53:45', '-1', '0', '0', '1', '', '1', '');
INSERT INTO `xdict` VALUES ('101001026003.000', '101001026.000', '0', '', 'currency2', '欧元', 'String', '1', '2015-09-27 08:08:16', '2012-05-14 07:53:58', '-1', '0', '0', '1', '', '2', '');
